GopalSaraf/Practicals/PSDL/include/proc/pic18lf27k40.h
// Register: TOSL
#define TOSL TOSL
extern volatile unsigned char           TOSL                __at(0xFFD);
#ifndef _LIB_BUILD
asm("TOSL equ 0FFDh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TOSL                   :8;
    };
} TOSLbits_t;
extern volatile TOSLbits_t TOSLbits __at(0xFFD);
// bitfield macros
#define _TOSL_TOSL_POSN                                     0x0
#define _TOSL_TOSL_POSITION                                 0x0
#define _TOSL_TOSL_SIZE                                     0x8
#define _TOSL_TOSL_LENGTH                                   0x8
#define _TOSL_TOSL_MASK                                     0xFF

// Register: TOSH
#define TOSH TOSH
extern volatile unsigned char           TOSH                __at(0xFFE);
#ifndef _LIB_BUILD
asm("TOSH equ 0FFEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TOSH                   :8;
    };
} TOSHbits_t;
extern volatile TOSHbits_t TOSHbits __at(0xFFE);
// bitfield macros
#define _TOSH_TOSH_POSN                                     0x0
#define _TOSH_TOSH_POSITION                                 0x0
#define _TOSH_TOSH_SIZE                                     0x8
#define _TOSH_TOSH_LENGTH                                   0x8
#define _TOSH_TOSH_MASK                                     0xFF

// Register: TOSU
#define TOSU TOSU
extern volatile unsigned char           TOSU                __at(0xFFF);
#ifndef _LIB_BUILD
asm("TOSU equ 0FFFh");
#endif

/*
 * Bit Definitions
 */
#define _DEPRECATED __attribute__((__deprecated__))
#ifndef BANKMASK
#define BANKMASK(addr) ((addr)&0FFh)
#endif
#define _BIT_ACCESS(r,b) ___mkstr(BANKMASK(r)) "," ___mkstr(b)
#ifndef PAGEMASK
#define PAGEMASK(addr) ((addr)&0FFFFFh)
#endif
// BAUD1CON<ABDEN1>
extern volatile __bit                   ABDEN1              __at(0x7CF8);	// @ (0xF9F * 8 + 0)
#define                                 ABDEN1_bit          _BIT_ACCESS(BAUD1CON,0)
// BAUD2CON<ABDEN2>
extern volatile __bit                   ABDEN2              __at(0x74F8);	// @ (0xE9F * 8 + 0)
#define                                 ABDEN2_bit          _BIT_ACCESS(BAUD2CON,0)
// BAUD1CON<ABDOVF1>
extern volatile __bit                   ABDOVF1             __at(0x7CFF);	// @ (0xF9F * 8 + 7)
#define                                 ABDOVF1_bit         _BIT_ACCESS(BAUD1CON,7)
// BAUD2CON<ABDOVF2>
extern volatile __bit                   ABDOVF2             __at(0x74FF);	// @ (0xE9F * 8 + 7)
#define                                 ABDOVF2_bit         _BIT_ACCESS(BAUD2CON,7)
// CRCACCL<ACC0>
extern volatile __bit                   ACC0                __at(0x7BB0);	// @ (0xF76 * 8 + 0)
#define                                 ACC0_bit            _BIT_ACCESS(CRCACCL,0)
// CRCACCL<ACC1>
extern volatile __bit                   ACC1                __at(0x7BB1);	// @ (0xF76 * 8 + 1)
#define                                 ACC1_bit            _BIT_ACCESS(CRCACCL,1)
// CRCACCH<ACC10>
extern volatile __bit                   ACC10               __at(0x7BBA);	// @ (0xF77 * 8 + 2)
#define                                 ACC10_bit           _BIT_ACCESS(CRCACCH,2)
// CRCACCH<ACC11>
extern volatile __bit                   ACC11               __at(0x7BBB);	// @ (0xF77 * 8 + 3)
#define                                 ACC11_bit           _BIT_ACCESS(CRCACCH,3)
// CRCACCH<ACC12>
extern volatile __bit                   ACC12               __at(0x7BBC);	// @ (0xF77 * 8 + 4)
#define                                 ACC12_bit           _BIT_ACCESS(CRCACCH,4)
// CRCACCH<ACC13>
extern volatile __bit                   ACC13               __at(0x7BBD);	// @ (0xF77 * 8 + 5)
#define                                 ACC13_bit           _BIT_ACCESS(CRCACCH,5)
// CRCACCH<ACC14>
extern volatile __bit                   ACC14               __at(0x7BBE);	// @ (0xF77 * 8 + 6)
#define                                 ACC14_bit           _BIT_ACCESS(CRCACCH,6)
// CRCACCH<ACC15>
extern volatile __bit                   ACC15               __at(0x7BBF);	// @ (0xF77 * 8 + 7)
#define                                 ACC15_bit           _BIT_ACCESS(CRCACCH,7)
// CRCACCL<ACC2>
extern volatile __bit                   ACC2                __at(0x7BB2);	// @ (0xF76 * 8 + 2)
#define                                 ACC2_bit            _BIT_ACCESS(CRCACCL,2)
// CRCACCL<ACC3>
extern volatile __bit                   ACC3                __at(0x7BB3);	// @ (0xF76 * 8 + 3)
#define                                 ACC3_bit            _BIT_ACCESS(CRCACCL,3)
// CRCACCL<ACC4>
extern volatile __bit                   ACC4                __at(0x7BB4);	// @ (0xF76 * 8 + 4)
#define                                 ACC4_bit            _BIT_ACCESS(CRCACCL,4)
// CRCACCL<ACC5>
extern volatile __bit                   ACC5                __at(0x7BB5);	// @ (0xF76 * 8 + 5)
#define                                 ACC5_bit            _BIT_ACCESS(CRCACCL,5)
// CRCACCL<ACC6>
extern volatile __bit                   ACC6                __at(0x7BB6);	// @ (0xF76 * 8 + 6)
#define                                 ACC6_bit            _BIT_ACCESS(CRCACCL,6)
// CRCACCL<ACC7>
extern volatile __bit                   ACC7                __at(0x7BB7);	// @ (0xF76 * 8 + 7)
#define                                 ACC7_bit            _BIT_ACCESS(CRCACCL,7)
// CRCACCH<ACC8>
extern volatile __bit                   ACC8                __at(0x7BB8);	// @ (0xF77 * 8 + 0)
#define                                 ACC8_bit            _BIT_ACCESS(CRCACCH,0)
// CRCACCH<ACC9>
extern volatile __bit                   ACC9                __at(0x7BB9);	// @ (0xF77 * 8 + 1)
#define                                 ACC9_bit            _BIT_ACCESS(CRCACCH,1)
// CRCCON0<ACCM>
extern volatile __bit                   ACCM                __at(0x7BE4);	// @ (0xF7C * 8 + 4)
#define                                 ACCM_bit            _BIT_ACCESS(CRCCON0,4)
// SSP1CON2<ACKDT1>
extern volatile __bit                   ACKDT1              __at(0x7CBD);	// @ (0xF97 * 8 + 5)
#define                                 ACKDT1_bit          _BIT_ACCESS(SSP1CON2,5)
// SSP2CON2<ACKDT2>
extern volatile __bit                   ACKDT2              __at(0x74BD);	// @ (0xE97 * 8 + 5)
#define                                 ACKDT2_bit          _BIT_ACCESS(SSP2CON2,5)
// SSP1CON2<ACKEN1>
extern volatile __bit                   ACKEN1              __at(0x7CBC);	// @ (0xF97 * 8 + 4)
#define                                 ACKEN1_bit          _BIT_ACCESS(SSP1CON2,4)
// SSP2CON2<ACKEN2>
extern volatile __bit                   ACKEN2              __at(0x74BC);	// @ (0xE97 * 8 + 4)
#define                                 ACKEN2_bit          _BIT_ACCESS(SSP2CON2,4)
// SSP1CON2<ACKSTAT1>
extern volatile __bit                   ACKSTAT1            __at(0x7CBE);	// @ (0xF97 * 8 + 6)
#define                                 ACKSTAT1_bit        _BIT_ACCESS(SSP1CON2,6)
// SSP2CON2<ACKSTAT2>
extern volatile __bit                   ACKSTAT2            __at(0x74BE);	// @ (0xE97 * 8 + 6)
#define                                 ACKSTAT2_bit        _BIT_ACCESS(SSP2CON2,6)
// TBLPTRU<ACSS>
extern volatile __bit                   ACSS                __at(0x7FC5);	// @ (0xFF8 * 8 + 5)
#define                                 ACSS_bit            _BIT_ACCESS(TBLPTRU,5)
// ADACCL<ADACC0>
extern volatile __bit                   ADACC0              __at(0x7B80);	// @ (0xF70 * 8 + 0)
#define                                 ADACC0_bit          _BIT_ACCESS(ADACCL,0)
// ADACCL<ADACC1>
extern volatile __bit                   ADACC1              __at(0x7B81);	// @ (0xF70 * 8 + 1)
#define                                 ADACC1_bit          _BIT_ACCESS(ADACCL,1)
// ADACCH<ADACC10>
extern volatile __bit                   ADACC10             __at(0x7B8A);	// @ (0xF71 * 8 + 2)
#define                                 ADACC10_bit         _BIT_ACCESS(ADACCH,2)
// ADACCH<ADACC11>
extern volatile __bit                   ADACC11             __at(0x7B8B);	// @ (0xF71 * 8 + 3)
#define                                 ADACC11_bit         _BIT_ACCESS(ADACCH,3)
// ADACCH<ADACC12>
extern volatile __bit                   ADACC12             __at(0x7B8C);	// @ (0xF71 * 8 + 4)
#define                                 ADACC12_bit         _BIT_ACCESS(ADACCH,4)
// ADACCH<ADACC13>
extern volatile __bit                   ADACC13             __at(0x7B8D);	// @ (0xF71 * 8 + 5)
#define                                 ADACC13_bit         _BIT_ACCESS(ADACCH,5)
// ADACCH<ADACC14>
extern volatile __bit                   ADACC14             __at(0x7B8E);	// @ (0xF71 * 8 + 6)
#define                                 ADACC14_bit         _BIT_ACCESS(ADACCH,6)
// ADACCH<ADACC15>
extern volatile __bit                   ADACC15             __at(0x7B8F);	// @ (0xF71 * 8 + 7)
#define                                 ADACC15_bit         _BIT_ACCESS(ADACCH,7)
// ADACCL<ADACC2>
extern volatile __bit                   ADACC2              __at(0x7B82);	// @ (0xF70 * 8 + 2)
#define                                 ADACC2_bit          _BIT_ACCESS(ADACCL,2)
// ADACCL<ADACC3>
extern volatile __bit                   ADACC3              __at(0x7B83);	// @ (0xF70 * 8 + 3)
#define                                 ADACC3_bit          _BIT_ACCESS(ADACCL,3)
// ADACCL<ADACC4>
extern volatile __bit                   ADACC4              __at(0x7B84);	// @ (0xF70 * 8 + 4)
#define                                 ADACC4_bit          _BIT_ACCESS(ADACCL,4)
// ADACCL<ADACC5>
extern volatile __bit                   ADACC5              __at(0x7B85);	// @ (0xF70 * 8 + 5)
#define                                 ADACC5_bit          _BIT_ACCESS(ADACCL,5)
// ADACCL<ADACC6>
extern volatile __bit                   ADACC6              __at(0x7B86);	// @ (0xF70 * 8 + 6)
#define                                 ADACC6_bit          _BIT_ACCESS(ADACCL,6)
// ADACCL<ADACC7>
extern volatile __bit                   ADACC7              __at(0x7B87);	// @ (0xF70 * 8 + 7)
#define                                 ADACC7_bit          _BIT_ACCESS(ADACCL,7)
// ADACCH<ADACC8>
extern volatile __bit                   ADACC8              __at(0x7B88);	// @ (0xF71 * 8 + 0)
#define                                 ADACC8_bit          _BIT_ACCESS(ADACCH,0)
// ADACCH<ADACC9>
extern volatile __bit                   ADACC9              __at(0x7B89);	// @ (0xF71 * 8 + 1)
#define                                 ADACC9_bit          _BIT_ACCESS(ADACCH,1)
// ADCON2<ADACLR>
extern volatile __bit                   ADACLR              __at(0x7AD3);	// @ (0xF5A * 8 + 3)
#define                                 ADACLR_bit          _BIT_ACCESS(ADCON2,3)
// ADACQ<ADACQ0>
extern volatile __bit                   ADACQ0              __at(0x7AE0);	// @ (0xF5C * 8 + 0)
#define                                 ADACQ0_bit          _BIT_ACCESS(ADACQ,0)
// ADACQ<ADACQ1>
extern volatile __bit                   ADACQ1              __at(0x7AE1);	// @ (0xF5C * 8 + 1)
#define                                 ADACQ1_bit          _BIT_ACCESS(ADACQ,1)
// ADACQ<ADACQ2>
extern volatile __bit                   ADACQ2              __at(0x7AE2);	// @ (0xF5C * 8 + 2)
#define                                 ADACQ2_bit          _BIT_ACCESS(ADACQ,2)
// ADACQ<ADACQ3>
extern volatile __bit                   ADACQ3              __at(0x7AE3);	// @ (0xF5C * 8 + 3)
#define                                 ADACQ3_bit          _BIT_ACCESS(ADACQ,3)
// ADACQ<ADACQ4>
extern volatile __bit                   ADACQ4              __at(0x7AE4);	// @ (0xF5C * 8 + 4)
#define                                 ADACQ4_bit          _BIT_ACCESS(ADACQ,4)
// ADACQ<ADACQ5>
extern volatile __bit                   ADACQ5              __at(0x7AE5);	// @ (0xF5C * 8 + 5)
#define                                 ADACQ5_bit          _BIT_ACCESS(ADACQ,5)
// ADACQ<ADACQ6>
extern volatile __bit                   ADACQ6              __at(0x7AE6);	// @ (0xF5C * 8 + 6)
#define                                 ADACQ6_bit          _BIT_ACCESS(ADACQ,6)
// ADACQ<ADACQ7>
extern volatile __bit                   ADACQ7              __at(0x7AE7);	// @ (0xF5C * 8 + 7)
#define                                 ADACQ7_bit          _BIT_ACCESS(ADACQ,7)
// ADACT<ADACT0>
extern volatile __bit                   ADACT0              __at(0x7AB0);	// @ (0xF56 * 8 + 0)
#define                                 ADACT0_bit          _BIT_ACCESS(ADACT,0)
// ADACT<ADACT1>
extern volatile __bit                   ADACT1              __at(0x7AB1);	// @ (0xF56 * 8 + 1)
#define                                 ADACT1_bit          _BIT_ACCESS(ADACT,1)
// ADACT<ADACT2>
extern volatile __bit                   ADACT2              __at(0x7AB2);	// @ (0xF56 * 8 + 2)
#define                                 ADACT2_bit          _BIT_ACCESS(ADACT,2)
// ADACT<ADACT3>
extern volatile __bit                   ADACT3              __at(0x7AB3);	// @ (0xF56 * 8 + 3)
#define                                 ADACT3_bit          _BIT_ACCESS(ADACT,3)
// ADACT<ADACT4>
extern volatile __bit                   ADACT4              __at(0x7AB4);	// @ (0xF56 * 8 + 4)
#define                                 ADACT4_bit          _BIT_ACCESS(ADACT,4)
// ADACTPPS<ADACTPPS0>
extern volatile __bit                   ADACTPPS0           __at(0x7570);	// @ (0xEAE * 8 + 0)
#define                                 ADACTPPS0_bit       _BIT_ACCESS(ADACTPPS,0)
// ADACTPPS<ADACTPPS1>
extern volatile __bit                   ADACTPPS1           __at(0x7571);	// @ (0xEAE * 8 + 1)
#define                                 ADACTPPS1_bit       _BIT_ACCESS(ADACTPPS,1)
// ADACTPPS<ADACTPPS2>
extern volatile __bit                   ADACTPPS2           __at(0x7572);	// @ (0xEAE * 8 + 2)
#define                                 ADACTPPS2_bit       _BIT_ACCESS(ADACTPPS,2)
// ADACTPPS<ADACTPPS3>
extern volatile __bit                   ADACTPPS3           __at(0x7573);	// @ (0xEAE * 8 + 3)
#define                                 ADACTPPS3_bit       _BIT_ACCESS(ADACTPPS,3)
// ADACTPPS<ADACTPPS4>
extern volatile __bit                   ADACTPPS4           __at(0x7574);	// @ (0xEAE * 8 + 4)
#define                                 ADACTPPS4_bit       _BIT_ACCESS(ADACTPPS,4)
// ADSTAT<ADAOV>
extern volatile __bit                   ADAOV               __at(0x7B2F);	// @ (0xF65 * 8 + 7)
#define                                 ADAOV_bit           _BIT_ACCESS(ADSTAT,7)
// ADCON0<ADCAL>
extern volatile __bit                   ADCAL               __at(0x7B07);	// @ (0xF60 * 8 + 7)
#define                                 ADCAL_bit           _BIT_ACCESS(ADCON0,7)
// ADCON3<ADCALC0>
extern volatile __bit                   ADCALC0             __at(0x7ADC);	// @ (0xF5B * 8 + 4)
#define                                 ADCALC0_bit         _BIT_ACCESS(ADCON3,4)
// ADCON3<ADCALC1>
extern volatile __bit                   ADCALC1             __at(0x7ADD);	// @ (0xF5B * 8 + 5)
#define                                 ADCALC1_bit         _BIT_ACCESS(ADCON3,5)
// ADCON3<ADCALC2>
extern volatile __bit                   ADCALC2             __at(0x7ADE);	// @ (0xF5B * 8 + 6)
#define                                 ADCALC2_bit         _BIT_ACCESS(ADCON3,6)
// ADCAP<ADCAP0>
extern volatile __bit                   ADCAP0              __at(0x7AE8);	// @ (0xF5D * 8 + 0)
#define                                 ADCAP0_bit          _BIT_ACCESS(ADCAP,0)
// ADCAP<ADCAP1>
extern volatile __bit                   ADCAP1              __at(0x7AE9);	// @ (0xF5D * 8 + 1)
#define                                 ADCAP1_bit          _BIT_ACCESS(ADCAP,1)
// ADCAP<ADCAP2>
extern volatile __bit                   ADCAP2              __at(0x7AEA);	// @ (0xF5D * 8 + 2)
#define                                 ADCAP2_bit          _BIT_ACCESS(ADCAP,2)
// ADCAP<ADCAP3>
extern volatile __bit                   ADCAP3              __at(0x7AEB);	// @ (0xF5D * 8 + 3)
#define                                 ADCAP3_bit          _BIT_ACCESS(ADCAP,3)
// ADCAP<ADCAP4>
extern volatile __bit                   ADCAP4              __at(0x7AEC);	// @ (0xF5D * 8 + 4)
#define                                 ADCAP4_bit          _BIT_ACCESS(ADCAP,4)
// PMD2<ADCMD>
extern volatile __bit                   ADCMD               __at(0x771D);	// @ (0xEE3 * 8 + 5)
#define                                 ADCMD_bit           _BIT_ACCESS(PMD2,5)
// ADCNT<ADCNT0>
extern volatile __bit                   ADCNT0              __at(0x7B38);	// @ (0xF67 * 8 + 0)
#define                                 ADCNT0_bit          _BIT_ACCESS(ADCNT,0)
// ADCNT<ADCNT1>
extern volatile __bit                   ADCNT1              __at(0x7B39);	// @ (0xF67 * 8 + 1)
#define                                 ADCNT1_bit          _BIT_ACCESS(ADCNT,1)
// ADCNT<ADCNT2>
extern volatile __bit                   ADCNT2              __at(0x7B3A);	// @ (0xF67 * 8 + 2)
#define                                 ADCNT2_bit          _BIT_ACCESS(ADCNT,2)
// ADCNT<ADCNT3>
extern volatile __bit                   ADCNT3              __at(0x7B3B);	// @ (0xF67 * 8 + 3)
#define                                 ADCNT3_bit          _BIT_ACCESS(ADCNT,3)
// ADCNT<ADCNT4>
extern volatile __bit                   ADCNT4              __at(0x7B3C);	// @ (0xF67 * 8 + 4)
#define                                 ADCNT4_bit          _BIT_ACCESS(ADCNT,4)
// ADCNT<ADCNT5>
extern volatile __bit                   ADCNT5              __at(0x7B3D);	// @ (0xF67 * 8 + 5)
#define                                 ADCNT5_bit          _BIT_ACCESS(ADCNT,5)
// ADCNT<ADCNT6>
extern volatile __bit                   ADCNT6              __at(0x7B3E);	// @ (0xF67 * 8 + 6)
#define                                 ADCNT6_bit          _BIT_ACCESS(ADCNT,6)
// ADCNT<ADCNT7>
extern volatile __bit                   ADCNT7              __at(0x7B3F);	// @ (0xF67 * 8 + 7)
#define                                 ADCNT7_bit          _BIT_ACCESS(ADCNT,7)
// ADCON0<ADCONT>
extern volatile __bit                   ADCONT              __at(0x7B06);	// @ (0xF60 * 8 + 6)
#define                                 ADCONT_bit          _BIT_ACCESS(ADCON0,6)
// ADCON2<ADCRS0>
extern volatile __bit                   ADCRS0              __at(0x7AD4);	// @ (0xF5A * 8 + 4)
#define                                 ADCRS0_bit          _BIT_ACCESS(ADCON2,4)
// ADCON2<ADCRS1>
extern volatile __bit                   ADCRS1              __at(0x7AD5);	// @ (0xF5A * 8 + 5)
#define                                 ADCRS1_bit          _BIT_ACCESS(ADCON2,5)
// ADCON2<ADCRS2>
extern volatile __bit                   ADCRS2              __at(0x7AD6);	// @ (0xF5A * 8 + 6)
#define                                 ADCRS2_bit          _BIT_ACCESS(ADCON2,6)
// ADCON0<ADCS>
extern volatile __bit                   ADCS                __at(0x7B04);	// @ (0xF60 * 8 + 4)
#define                                 ADCS_bit            _BIT_ACCESS(ADCON0,4)
// ADCLK<ADCS0>
extern volatile __bit                   ADCS0               __at(0x7AB8);	// @ (0xF57 * 8 + 0)
#define                                 ADCS0_bit           _BIT_ACCESS(ADCLK,0)
// ADCLK<ADCS1>
extern volatile __bit                   ADCS1               __at(0x7AB9);	// @ (0xF57 * 8 + 1)
#define                                 ADCS1_bit           _BIT_ACCESS(ADCLK,1)
// ADCLK<ADCS2>
extern volatile __bit                   ADCS2               __at(0x7ABA);	// @ (0xF57 * 8 + 2)
#define                                 ADCS2_bit           _BIT_ACCESS(ADCLK,2)
// ADCLK<ADCS3>
extern volatile __bit                   ADCS3               __at(0x7ABB);	// @ (0xF57 * 8 + 3)
#define                                 ADCS3_bit           _BIT_ACCESS(ADCLK,3)
// ADCLK<ADCS4>
extern volatile __bit                   ADCS4               __at(0x7ABC);	// @ (0xF57 * 8 + 4)
#define                                 ADCS4_bit           _BIT_ACCESS(ADCLK,4)
// ADCLK<ADCS5>
extern volatile __bit                   ADCS5               __at(0x7ABD);	// @ (0xF57 * 8 + 5)
#define                                 ADCS5_bit           _BIT_ACCESS(ADCLK,5)
// ADCON1<ADDSEN>
extern volatile __bit                   ADDSEN              __at(0x7AC8);	// @ (0xF59 * 8 + 0)
#define                                 ADDSEN_bit          _BIT_ACCESS(ADCON1,0)
// ADERRL<ADERR0>
extern volatile __bit                   ADERR0              __at(0x7B70);	// @ (0xF6E * 8 + 0)
#define                                 ADERR0_bit          _BIT_ACCESS(ADERRL,0)
// ADERRL<ADERR1>
extern volatile __bit                   ADERR1              __at(0x7B71);	// @ (0xF6E * 8 + 1)
#define                                 ADERR1_bit          _BIT_ACCESS(ADERRL,1)
// ADERRH<ADERR10>
extern volatile __bit                   ADERR10             __at(0x7B7A);	// @ (0xF6F * 8 + 2)
#define                                 ADERR10_bit         _BIT_ACCESS(ADERRH,2)
// ADERRH<ADERR11>
extern volatile __bit                   ADERR11             __at(0x7B7B);	// @ (0xF6F * 8 + 3)
#define                                 ADERR11_bit         _BIT_ACCESS(ADERRH,3)
// ADERRH<ADERR12>
extern volatile __bit                   ADERR12             __at(0x7B7C);	// @ (0xF6F * 8 + 4)
#define                                 ADERR12_bit         _BIT_ACCESS(ADERRH,4)
// ADERRH<ADERR13>
extern volatile __bit                   ADERR13             __at(0x7B7D);	// @ (0xF6F * 8 + 5)
#define                                 ADERR13_bit         _BIT_ACCESS(ADERRH,5)
// ADERRH<ADERR14>
extern volatile __bit                   ADERR14             __at(0x7B7E);	// @ (0xF6F * 8 + 6)
#define                                 ADERR14_bit         _BIT_ACCESS(ADERRH,6)
// ADERRH<ADERR15>
extern volatile __bit                   ADERR15             __at(0x7B7F);	// @ (0xF6F * 8 + 7)
#define                                 ADERR15_bit         _BIT_ACCESS(ADERRH,7)
// ADERRL<ADERR2>
extern volatile __bit                   ADERR2              __at(0x7B72);	// @ (0xF6E * 8 + 2)
#define                                 ADERR2_bit          _BIT_ACCESS(ADERRL,2)
// ADERRL<ADERR3>
extern volatile __bit                   ADERR3              __at(0x7B73);	// @ (0xF6E * 8 + 3)
#define                                 ADERR3_bit          _BIT_ACCESS(ADERRL,3)
// ADERRL<ADERR4>
extern volatile __bit                   ADERR4              __at(0x7B74);	// @ (0xF6E * 8 + 4)
#define                                 ADERR4_bit          _BIT_ACCESS(ADERRL,4)
// ADERRL<ADERR5>
extern volatile __bit                   ADERR5              __at(0x7B75);	// @ (0xF6E * 8 + 5)
#define                                 ADERR5_bit          _BIT_ACCESS(ADERRL,5)
// ADERRL<ADERR6>
extern volatile __bit                   ADERR6              __at(0x7B76);	// @ (0xF6E * 8 + 6)
#define                                 ADERR6_bit          _BIT_ACCESS(ADERRL,6)
// ADERRL<ADERR7>
extern volatile __bit                   ADERR7              __at(0x7B77);	// @ (0xF6E * 8 + 7)
#define                                 ADERR7_bit          _BIT_ACCESS(ADERRL,7)
// ADERRH<ADERR8>
extern volatile __bit                   ADERR8              __at(0x7B78);	// @ (0xF6F * 8 + 0)
#define                                 ADERR8_bit          _BIT_ACCESS(ADERRH,0)
// ADERRH<ADERR9>
extern volatile __bit                   ADERR9              __at(0x7B79);	// @ (0xF6F * 8 + 1)
#define                                 ADERR9_bit          _BIT_ACCESS(ADERRH,1)
// ADFLTRL<ADFLTR0>
extern volatile __bit                   ADFLTR0             __at(0x7B90);	// @ (0xF72 * 8 + 0)
#define                                 ADFLTR0_bit         _BIT_ACCESS(ADFLTRL,0)
// ADFLTRL<ADFLTR1>
extern volatile __bit                   ADFLTR1             __at(0x7B91);	// @ (0xF72 * 8 + 1)
#define                                 ADFLTR1_bit         _BIT_ACCESS(ADFLTRL,1)
// ADFLTRH<ADFLTR10>
extern volatile __bit                   ADFLTR10            __at(0x7B9A);	// @ (0xF73 * 8 + 2)
#define                                 ADFLTR10_bit        _BIT_ACCESS(ADFLTRH,2)
// ADFLTRH<ADFLTR11>
extern volatile __bit                   ADFLTR11            __at(0x7B9B);	// @ (0xF73 * 8 + 3)
